//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//
//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
// Revision History
// ----------------
// $Log: $
// 
//*************************************************************************
//<AMI_FHDR_START>
//
// Name:  <F81216.UNI>
//
// Description: SIO Form String Definitions
//
//<AMI_FHDR_END>
//*************************************************************************
/=#
#include "VFR.uni"
#string STR_F81216SEC_SIO_FORM                        #language eng "F81216 Second Super IO Configuration"
#string STR_F81216SEC_SIO_FORM_HELP                   #language eng "System Second Super IO Chip Parameters."
#string STR_F81216SEC_SIO_PROMPT                      #language eng "F81216 Second Super IO Chip"
#string STR_F81216SEC                                 #language eng "F81216 SecondIo"
//
//Serial 3/4/5/6 Settings
//
#string STR_F81216SEC_SERIAL0_FORM                    #language eng "Serial Port 0 Configuration"
#string STR_F81216SEC_SERIAL0_FORM_HELP               #language eng "Set Parameters of Serial Port 0 (COMA)"
#string STR_F81216SEC_SERIAL1_FORM                    #language eng "Serial Port 1 Configuration"
#string STR_F81216SEC_SERIAL1_FORM_HELP               #language eng "Set Parameters of Serial Port 1 (COMB)"
#string STR_F81216SEC_SERIAL2_FORM                    #language eng "Serial Port 2 Configuration"
#string STR_F81216SEC_SERIAL2_FORM_HELP               #language eng "Set Parameters of Serial Port 2 (COMC)"
#string STR_F81216SEC_SERIAL3_FORM                    #language eng "Serial Port 3 Configuration"
#string STR_F81216SEC_SERIAL3_FORM_HELP               #language eng "Set Parameters of Serial Port 3 (COMD)"
#string STR_F81216SEC_SERIAL0_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81216SEC_SERIAL1_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81216SEC_SERIAL2_CONFIG_VALUE            #language eng "Reset Required"
#string STR_F81216SEC_SERIAL3_CONFIG_VALUE            #language eng "Reset Required"

#string STR_F81216SEC_SERIAL_PROMPT                   #language eng "Serial Port"
#string STR_F81216SEC_SERIAL_PROMPT_HELP              #language eng "Enable or Disable Serial Port (COM)"

#string STR_F81216SEC_SERIAL_MODE_HELP               #language eng "Enable or Disable Serial Port (COM)"
#string STR_F81216SEC_SERIAL_MODE1                   #language eng "Serial Port Function Mode"
#string STR_F81216SEC_SERIAL_MODE2                   #language eng "IR Mode,Pusle 1.6us,Full Duplex"
#string STR_F81216SEC_SERIAL_MODE3                   #language eng "IR Mode,Pusle 1.6us,Half Duplex"
#string STR_F81216SEC_SERIAL_MODE4                   #language eng "IR Mode,Pusle 3/16 Bit Time,Full Duplex"
#string STR_F81216SEC_SERIAL_MODE5                   #language eng "IR Mode,Pusle 3/16 Bit Time,Half Duplex"

#string STR_F81216SEC_SERIAL0_SETTINGS1               #language eng "IO=260h; IRQ=11;"
#string STR_F81216SEC_SERIAL1_SETTINGS1               #language eng "IO=268h; IRQ=11;"
#string STR_F81216SEC_SERIAL2_SETTINGS1               #language eng "IO=270h; IRQ=11;"
#string STR_F81216SEC_SERIAL3_SETTINGS1               #language eng "IO=278h; IRQ=11;"

#string STR_F81216SEC_SERIAL_SETTINGS2                #language eng "IO=260h; IRQ=10,11,12;"
#string STR_F81216SEC_SERIAL_SETTINGS3                #language eng "IO=268h; IRQ=10,11,12;"
#string STR_F81216SEC_SERIAL_SETTINGS4                #language eng "IO=270h; IRQ=10,11,12;"
#string STR_F81216SEC_SERIAL_SETTINGS5                #language eng "IO=278h; IRQ=10,11,12;"

//
//PME Settings
//
#string STR_PME_WAKE_FROM_KEY               #language eng "Wake on Specific Key"

#string STR_SETTINGS_HELP                   #language eng "Select an optimal setting for Super IO device."
#string STR_AUTO                            #language eng "Auto"
#string STR_CHANGE_CONFIG                   #language eng "Change Settings"
#string STR_CURRENT_CONFIG                  #language eng "Device Settings"
#string STR_SELECT_MODE                     #language eng "Device Mode"

   
//#string <string name>                   #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************